{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality with product/cart/testimonial/user management, contact info, social media links, and hero section, using role-based access control (admin/user permissions) via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three admin panel features: route URL documentation, authentication checks via Internet Identity, and admin privilege verification in the backend.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, and their functionality, with details on routing, authentication, product display, cart management, and admin panel features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Koshambari application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Admin panel access guide documenting how to authenticate via Internet Identity, access admin routes (/admin, /admin/products, etc.), and troubleshoot common access issues.",
  "frontend/src/App.tsx": "Main application router setup using TanStack Router, defining all public routes (home, products, cart, checkout, contact) and protected admin routes (/admin/*) wrapped with AdminRoute for access control.",
  "frontend/src/components/AdminLayout.tsx": "Admin panel layout wrapper providing header with logout button, sidebar navigation via AdminNav, and main content area for admin pages.",
  "frontend/src/components/AdminNav.tsx": "Admin sidebar navigation component displaying links to dashboard, products, testimonials, contact info, social media, and hero section management pages with active state highlighting.",
  "frontend/src/components/AdminRoute.tsx": "Protected route component that verifies user authentication and admin privileges, redirecting non-authenticated users to login and non-admin users to home with appropriate error messages.",
  "frontend/src/components/CartItem.tsx": "Displays individual cart item with product image, details, quantity controls (increment/decrement), and remove button, using category-based fallback images.",
  "frontend/src/components/CategoryFilter.tsx": "Tab-based filter component for selecting product categories (All, Sarees, Western Dresses, Lehenga, Jewellery) with controlled selection state.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog component for delete operations with customizable title, description, and confirm callback.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick links, contact details, social media links, and copyright notice including caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Homepage hero section with background image, headline, description, and CTA buttons (Shop Now, Contact Us), with content fetched from backend or using defaults.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navbar, page content via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation header with logo, navigation links (Home, Products, Contact, Admin), shopping cart icon with item count badge, and responsive mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image, name, description, price, and 'Add to Cart' button with hover effects and category-based fallback images.",
  "frontend/src/components/ProductForm.tsx": "React form component for adding or editing products with fields for name, description, price, image URL, and category using react-hook-form and custom mutations.",
  "frontend/src/components/SocialMediaLinks.tsx": "Displays social media icons (Facebook, Instagram, WhatsApp) as circular buttons that link to URLs fetched from the backend with default fallbacks.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating component that displays 1-5 stars, supports interactive rating changes or read-only display mode.",
  "frontend/src/components/TestimonialCard.tsx": "Card component that displays a customer testimonial with star rating, review text, customer name, and date.",
  "frontend/src/components/TestimonialForm.tsx": "Form component for adding or editing testimonials with fields for customer name, star rating, review text, and date using react-hook-form.",
  "frontend/src/components/TestimonialsSection.tsx": "Section component that fetches and displays all testimonials in a responsive grid layout, showing a loader during fetch and hiding when empty.",
  "frontend/src/components/UpiPayment.tsx": "UPI payment interface with tabs for UPI ID entry and QR code scanning, simulates payment processing with a 90% success rate.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook that combines Internet Identity login state with admin role checking and provides login/logout functions.",
  "frontend/src/hooks/useCart.ts": "Cart management hook providing queries for cart items and total, mutations for add/update/remove operations, and computed cart item count.",
  "frontend/src/hooks/useContactInfo.ts": "Hooks for fetching contact information and updating it via mutations, including email, phone, address, and business hours.",
  "frontend/src/hooks/useHeroSection.ts": "Provides React Query hooks for fetching and updating the hero section data (headline, description, background image) via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and authentication status tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for CRUD operations on products, including fetching by category, adding, updating, and deleting products.",
  "frontend/src/hooks/useSocialMedia.ts": "Provides React Query hooks for fetching and updating social media links (Facebook, Instagram, WhatsApp) via the actor.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for CRUD operations on testimonials, including fetching, adding, updating, and deleting customer reviews.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette (maroon, gold, purple theme), typography using Playfair Display and Inter fonts, and light/dark mode variables.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminContactInfo.tsx": "Admin page with a form for updating contact information (email, phone, address, business hours) using react-hook-form and displaying loading/success states.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying statistics cards for products, testimonials, and categories, plus quick action links for common admin tasks.",
  "frontend/src/pages/AdminHeroSection.tsx": "Admin page for editing the homepage hero section with form fields for headline, description, and background image URL, including live image preview.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity, checks admin privileges, and redirects to admin panel or shows access denied messages.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with a table view showing all products and actions to add, edit, or delete products via modal dialogs.",
  "frontend/src/pages/AdminSocialMedia.tsx": "Admin page for managing social media links (Facebook, Instagram, WhatsApp) with URL validation and optional visibility control.",
  "frontend/src/pages/AdminTestimonials.tsx": "Admin page for managing customer testimonials with a table displaying customer name, rating, review text, date, and edit/delete actions.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with an order summary sidebar showing subtotal, free shipping, and checkout button.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that collects customer delivery information (name, email, phone, address) and displays order summary with UPI payment integration. Navigates to payment success/failure pages based on transaction outcome.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying business contact information (email, phone, address, hours) in card layouts with icons. Fetches contact info from API with loading state and provides default fallback values.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section, three feature cards (Premium Quality, Authentic Products, Fast Delivery), and a collections grid showcasing product categories (Sarees, Dresses, Lehengas, Jewellery) with navigation to filtered product listings.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying error message with common failure reasons and action buttons to retry payment or return to cart.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page showing success icon, order confirmation message, delivery timeline, and navigation buttons to continue shopping or return home.",
  "frontend/src/pages/Products.tsx": "Products listing page with category filtering that displays products in a responsive grid layout. Shows loading skeletons during data fetch and empty state when no products match the selected category.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom fonts (Playfair Display and Inter), border radius utilities, shadows, and accordion animations, along with typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for Koshambari Store (lehenga store application) documenting admin panel access issues, existing features for authentication and admin verification, and a pending feature request to add admin navigation links."
}