{
  "backend/main.mo": "Main Motoko actor defining the e-commerce backend with product, cart, testimonial, user profile, and content management (hero, contact, social media) functionality, plus role-based access control for admin and user permissions.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: admin user management page with add/remove privileges functionality and a User Management navigation link in the admin sidebar.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including homepage, product catalog, cart, checkout, admin panel, authentication, and various UI components with their specific responsibilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Koshambari React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Admin panel access guide explaining how to authenticate with Internet Identity, verify admin privileges, access admin routes, and troubleshoot common access issues.",
  "frontend/src/App.tsx": "Main application router setup using TanStack Router with public routes (home, products, cart, checkout, contact) and protected admin routes (dashboard, products, testimonials, contact info, social media, hero section, user management) wrapped in AdminRoute and AdminLayout components.",
  "frontend/src/components/AdminLayout.tsx": "Admin panel layout wrapper providing sticky header with Koshambari Admin branding, user principal display, logout button, sidebar navigation, and main content area for all admin pages.",
  "frontend/src/components/AdminNav.tsx": "Admin sidebar navigation component rendering links to Dashboard, Products, Testimonials, Contact Info, Social Media, Hero Section, and User Management with active state highlighting and icons.",
  "frontend/src/components/AdminRoute.tsx": "Protected route component that verifies admin authentication and authorization, redirecting non-authenticated users to login and non-admin users to home with appropriate error messages.",
  "frontend/src/components/CartItem.tsx": "Displays individual cart item with product image, details, quantity controls (increment/decrement), total price calculation, and remove button functionality.",
  "frontend/src/components/CategoryFilter.tsx": "Tab-based category filter component allowing users to filter products by category (All, Sarees, Western Dresses, Lehenga, Jewellery).",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog component for delete operations with customizable title and description.",
  "frontend/src/components/Footer.tsx": "Site footer with brand information, quick links, contact details, social media links, and copyright notice including Caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Homepage hero section with dynamic background image, headline, description, and call-to-action buttons (Shop Now, Contact Us) fetched from backend or using defaults.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navbar, page content via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, navigation links (Home, Products, Contact, Admin), shopping cart icon with item count badge, and responsive mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image with hover zoom effect, name, description, price, and add-to-cart button with category-specific fallback images.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, image URL, and category. Uses react-hook-form for validation and mutations for create/update operations.",
  "frontend/src/components/SocialMediaLinks.tsx": "Displays social media icons (Facebook, Instagram, WhatsApp) as circular buttons that link to configured URLs with default fallbacks.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating component that displays 1-5 stars, supports interactive rating changes or read-only display mode.",
  "frontend/src/components/TestimonialCard.tsx": "Card component displaying a customer testimonial with star rating, review text, customer name, and date.",
  "frontend/src/components/TestimonialForm.tsx": "Form component for adding or editing testimonials with fields for customer name, star rating, review text, and date. Uses react-hook-form and mutations for CRUD operations.",
  "frontend/src/components/TestimonialsSection.tsx": "Section component that fetches and displays all testimonials in a responsive grid layout, with loading state and empty state handling.",
  "frontend/src/components/UpiPayment.tsx": "UPI payment interface with tabs for UPI ID entry and QR code scanning, simulates payment processing with 90% success rate.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance based on authentication state, initializes access control, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAdminManagement.ts": "Hooks for managing admin users with local storage persistence, providing queries and mutations for listing, assigning, and revoking admin roles.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook that combines Internet Identity login status with admin role checking, provides login/logout functions and loading states.",
  "frontend/src/hooks/useCart.ts": "React hook for managing shopping cart operations including fetching cart items, calculating totals, and mutations for adding, updating, and removing cart items with React Query.",
  "frontend/src/hooks/useContactInfo.ts": "React hooks for fetching and updating business contact information (email, phone, address, hours) using React Query and the backend actor.",
  "frontend/src/hooks/useHeroSection.ts": "React hooks for fetching and updating hero section content (headline, description, background image) using React Query and the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React hooks for product CRUD operations including fetching products by category, and mutations for adding, updating, and deleting products with React Query.",
  "frontend/src/hooks/useSocialMedia.ts": "React hooks for fetching and updating social media links (Facebook, Instagram, WhatsApp) using React Query and the backend actor.",
  "frontend/src/hooks/useTestimonials.ts": "React hooks for testimonial CRUD operations including fetching all testimonials and mutations for adding, updating, and deleting testimonials with React Query.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, custom color palette for light/dark modes using Indian-inspired colors (maroon, gold, purple), and font imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminContactInfo.tsx": "Admin page component with a form for editing business contact information (email, phone, address, hours) using react-hook-form and displaying loading/success states.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying statistics cards (products, testimonials, categories) and quick action links for managing products and content.",
  "frontend/src/pages/AdminHeroSection.tsx": "Admin page for editing the homepage hero section with form fields for headline, description, and background image URL with live preview.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page using Internet Identity authentication with access control checks, error handling for non-admin users, and navigation logic.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with a table view, add/edit/delete functionality using dialogs and forms, and category display.",
  "frontend/src/pages/AdminSocialMedia.tsx": "Admin page for updating social media links (Facebook, Instagram, WhatsApp) with URL validation and optional field handling.",
  "frontend/src/pages/AdminTestimonials.tsx": "Admin page for managing customer testimonials with table view, add/edit/delete operations, and display of ratings and review text.",
  "frontend/src/pages/AdminUserManagement.tsx": "Admin page for managing administrator privileges, allowing adding new admins by principal ID and revoking existing admin access with validation and confirmation dialogs.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with quantity controls, order summary with total calculation, and checkout navigation.",
  "frontend/src/pages/Checkout.tsx": "Checkout page collecting customer delivery information (name, email, phone, address) and integrating UPI payment flow with success/failure navigation.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying business contact information (email, phone, address, hours) fetched from backend with social media links integration.",
  "frontend/src/pages/Home.tsx": "Homepage featuring hero section, feature cards (quality, authenticity, delivery), category previews with navigation, and testimonials section.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page showing error message with common failure reasons and options to retry payment or return to cart.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page displaying order confirmation message with delivery timeline and navigation to continue shopping or return home.",
  "frontend/src/pages/Products.tsx": "Products page component that displays a filterable grid of products with category filtering, loading skeletons, and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography settings, animations, and design tokens for a fashion/jewelry e-commerce site.",
  "project_state.json": "Project state tracking file documenting existing admin user management features and pending feature requests for implementing an administrator privileges system."
}