{
  "backend/main.mo": "Main actor defining the e-commerce backend with product management (including Category enum with sarees, westernDresses, lehenga, jewellery), cart operations, testimonials, user profiles, contact info, social media links, hero section, and authorization integration using MixinAuthorization.",
  "backend/migration.mo": "Migration module that transforms old actor state (3 categories) to new actor state (4 categories including jewellery) by mapping OldCategory to NewCategory and updating all products and cart items accordingly.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for adding 'Jewellery' category across CategoryFilter, ProductForm, Home page preview cards, and ProductCard fallback image logic with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, layouts, pages (Home, Products, Cart, Checkout, Contact, Admin), and components (Navbar, Footer, ProductCard with jewellery support, CategoryFilter with 5 categories, forms, and admin panels).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Koshambari application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (public: home, products, cart, checkout, payment, contact; admin: login, dashboard, products, testimonials, contact-info, social-media, hero-section) wrapped with ThemeProvider and Toaster.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout wrapper component with sticky header showing Koshambari Admin branding, user principal display, logout button, sidebar navigation (AdminNav), and main content area for admin pages.",
  "frontend/src/components/AdminNav.tsx": "Admin sidebar navigation component with links to Dashboard, Products, Testimonials, Contact Info, Social Media, and Hero Section pages, highlighting the active route with primary background color.",
  "frontend/src/components/AdminRoute.tsx": "Protected route component that verifies user authentication and admin privileges, redirecting unauthorized users to login or home page.",
  "frontend/src/components/CartItem.tsx": "Displays individual cart item with product image, details, quantity controls, and remove button with price calculation.",
  "frontend/src/components/CategoryFilter.tsx": "Tab-based category filter component for products including All, Sarees, Western Dresses, Lehenga, and Jewellery options.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable alert dialog component for confirming delete actions with customizable title and description.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick links, contact details, social media links, and copyright notice including Caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying customizable headline, description, and background image with CTA buttons for shopping and contact.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navbar, page content outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, menu links (Home, Products, Contact, Admin), shopping cart icon with item count, and mobile menu toggle.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image, name, description, price, and add-to-cart button with hover effects and fallback images.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, image URL, and category selection.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icons (Facebook, Instagram, WhatsApp) as circular buttons that link to URLs fetched from the useSocialMediaLinks hook, with default fallback URLs.",
  "frontend/src/components/StarRating.tsx": "Displays a 5-star rating component that can be interactive or read-only, with filled yellow stars up to the rating value and empty stars beyond it.",
  "frontend/src/components/TestimonialCard.tsx": "Displays a single testimonial in a card format showing customer name, star rating, review text, and date.",
  "frontend/src/components/TestimonialForm.tsx": "Form component for adding or editing testimonials with fields for customer name, star rating, review text, and date, using react-hook-form and mutation hooks.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of testimonial cards fetched from the useTestimonials hook, with loading state and conditional rendering if no testimonials exist.",
  "frontend/src/components/UpiPayment.tsx": "UPI payment interface with tabs for UPI ID entry and QR code scanning, simulating payment processing with a 90% success rate after 2 seconds.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state and methods including identity, admin status check, login/logout functions, and loading states by combining useInternetIdentity and useActor hooks.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with queries for cart items and total, plus mutations for adding, updating quantity, and removing items, including a computed cart item count.",
  "frontend/src/hooks/useContactInfo.ts": "Provides query hook to fetch contact information and mutation hook to update email, phone, address, and business hours via the backend actor.",
  "frontend/src/hooks/useHeroSection.ts": "Provides query hook to fetch hero section data (headline, description, background image) and mutation hook to update it via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for product CRUD operations (useProducts, useAddProduct, useUpdateProduct, useDeleteProduct) that interact with the backend actor and manage cache invalidation.",
  "frontend/src/hooks/useSocialMedia.ts": "Provides React Query hooks for fetching and updating social media links (Facebook, Instagram, WhatsApp) via the backend actor.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for testimonial CRUD operations (fetch, add, update, delete) with automatic query cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom Indian-themed color palette (maroon, gold, purple) for light and dark modes, plus font imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AdminContactInfo.tsx": "Admin page for managing contact information (email, phone, address, business hours) using react-hook-form and backend mutations.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying statistics cards for products, testimonials, and categories with quick action links.",
  "frontend/src/pages/AdminHeroSection.tsx": "Admin page for editing hero section content (headline, description, background image) with live image preview and form validation.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity and redirects authenticated admins to the admin panel, showing error messages for non-admin users.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with a table view displaying product details and actions to add, edit, or delete products using dialogs and forms.",
  "frontend/src/pages/AdminSocialMedia.tsx": "Admin page for managing social media links (Facebook, Instagram, WhatsApp) with form validation and update functionality.",
  "frontend/src/pages/AdminTestimonials.tsx": "Admin page for managing customer testimonials with a table view and actions to add, edit, or delete testimonials.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with an order summary card and checkout button, showing empty state when cart is empty.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects customer delivery information and displays UPI payment interface after form validation, handling payment success/failure navigation.",
  "frontend/src/pages/Contact.tsx": "Contact page component that displays business contact information (email, phone, address, hours) in card layouts, fetching data from useContactInfo hook with loading states and default fallback values.",
  "frontend/src/pages/Home.tsx": "Home page component featuring a hero section, three feature cards (Premium Quality, Authentic Products, Fast Delivery), and a category preview grid with clickable cards for Sarees, Dresses, Lehenga, and Jewellery that navigate to filtered product listings.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with common failure reasons and action buttons to retry payment or return to cart.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page showing a success message, order details, and navigation buttons to continue shopping or return home.",
  "frontend/src/pages/Products.tsx": "Products listing page with category filtering, displaying products in a responsive grid with loading skeletons and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, custom fonts (Playfair Display, Inter), animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting existing features for Jewellery category integration across components (CategoryFilter, ProductForm, Home page, ProductCard) and pending feature requests for admin panel and backend enum updates."
}