{
  "backend/main.mo": "Main Motoko actor defining the e-commerce backend with product, cart, testimonial, user profile, contact info, social media, and hero section management. Includes role-based access control (admin/user permissions) and migration support for category changes (goldJewellery to lehenga).",
  "backend/migration.mo": "Migration module that transforms old actor state with #goldJewellery category to new state with #lehenga category, updating both products and cart items while preserving all other data.",
  "feature_evidence.json": "Feature evidence report documenting five frontend changes replacing 'Gold Jewellery' with 'Lehenga' across CategoryFilter, ProductForm, AdminProducts, Home page, and ProductCard components with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing the React application structure including routing, admin panel, product catalog, cart, checkout, and content management features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for consistent design system across the application.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (public and admin-protected), ThemeProvider, and Toaster for notifications.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout wrapper providing header with logout button, sidebar navigation, and main content area for all admin pages.",
  "frontend/src/components/AdminNav.tsx": "Navigation component for admin panel with links to Dashboard, Products, Testimonials, Contact Info, Social Media, and Hero Section pages. Highlights the active route.",
  "frontend/src/components/AdminRoute.tsx": "Protected route wrapper that checks authentication and admin privileges, redirecting unauthorized users to login or home page with appropriate error messages.",
  "frontend/src/components/CartItem.tsx": "Displays individual cart item with product image, name, description, quantity controls, price, and remove button. Handles quantity updates and item removal with toast notifications.",
  "frontend/src/components/CategoryFilter.tsx": "Tab-based filter component for product categories (All, Sarees, Western Dresses, Lehenga) that triggers category change callbacks.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog component for delete operations with customizable title, description, and confirm action.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick links, contact details, social media links, and copyright notice including caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Homepage hero section with background image, headline, description, and CTA buttons. Fetches content from hero section API with fallback defaults.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navbar, page content outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, navigation links (Home, Products, Contact, Admin), shopping cart icon with item count badge, and responsive mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image, name, description, price, and add-to-cart button. Uses category-based fallback images and handles cart operations with toast feedback.",
  "frontend/src/components/ProductForm.tsx": "React form component for adding/editing products with fields for name, description, price, image URL, and category using react-hook-form and custom mutations.",
  "frontend/src/components/SocialMediaLinks.tsx": "Displays social media icons (Facebook, Instagram, WhatsApp) as circular buttons with links fetched from backend or default values.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating component that displays 1-5 stars, supports interactive rating changes or read-only display mode.",
  "frontend/src/components/TestimonialCard.tsx": "Card component displaying a customer testimonial with star rating, review text, customer name, and date.",
  "frontend/src/components/TestimonialForm.tsx": "Form component for adding/editing testimonials with fields for customer name, star rating, review text, and date using react-hook-form.",
  "frontend/src/components/TestimonialsSection.tsx": "Section component that fetches and displays all testimonials in a responsive grid layout, with loading state and empty state handling.",
  "frontend/src/components/UpiPayment.tsx": "UPI payment interface with tabs for UPI ID entry and QR code scanning, simulates payment processing with 90% success rate.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook that combines Internet Identity login with admin role checking, providing login/logout functions and authentication state.",
  "frontend/src/hooks/useCart.ts": "Shopping cart hook providing queries for cart items and total, plus mutations for adding, updating, and removing cart items with automatic cache invalidation.",
  "frontend/src/hooks/useContactInfo.ts": "Hook for fetching and updating contact information (email, phone, address, business hours) with query and mutation functions.",
  "frontend/src/hooks/useHeroSection.ts": "Provides React Query hooks for fetching and updating the hero section data (headline, description, background image) via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and authentication status tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for CRUD operations on products, including fetching by category, adding, updating, and deleting products.",
  "frontend/src/hooks/useSocialMedia.ts": "Provides React Query hooks for fetching and updating social media links (Facebook, Instagram, WhatsApp) via the actor.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for CRUD operations on testimonials, including fetching, adding, updating, and deleting customer reviews.",
  "frontend/src/index.css": "Defines global styles with Tailwind CSS, custom CSS variables for a premium Indian color palette (maroon, gold, purple), and font imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminContactInfo.tsx": "Admin page with a form for updating contact information (email, phone, address, business hours) using react-hook-form and displaying loading/success states.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying statistics cards for total products, testimonials, and categories, plus quick action links for common admin tasks.",
  "frontend/src/pages/AdminHeroSection.tsx": "Admin page for editing the homepage hero section content including headline, description, and background image URL with live preview. Uses react-hook-form for form management and displays success/error toasts on submission.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity and checks for admin privileges. Redirects authenticated admins to the admin panel and displays error messages for unauthorized users.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with a table view showing product images, names, categories, and prices. Provides add, edit, and delete functionality with confirmation dialogs and toast notifications.",
  "frontend/src/pages/AdminSocialMedia.tsx": "Admin page for managing social media links (Facebook, Instagram, WhatsApp) with URL validation. Uses react-hook-form and displays toast notifications on successful updates or errors.",
  "frontend/src/pages/AdminTestimonials.tsx": "Admin page for managing customer testimonials with a table displaying customer names, ratings, review text, and dates. Includes add, edit, and delete operations with confirmation dialogs.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with an order summary sidebar showing subtotal, free shipping, and total. Shows empty state when cart is empty and provides checkout navigation.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects customer delivery information (name, email, phone, address) and displays order summary, then shows UPI payment component after form validation.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying business contact information (email, phone, address, hours) fetched from API with loading state and social media links.",
  "frontend/src/pages/Home.tsx": "Home page with hero section, feature cards (premium quality, authenticity, fast delivery), and category preview cards for sarees, western wear, and lehengas.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page showing error icon, common failure reasons, and buttons to retry payment or return to cart.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page displaying confirmation message, delivery timeline, and navigation buttons to continue shopping or return home.",
  "frontend/src/pages/Products.tsx": "Products listing page with category filter, loading skeletons, and grid display of product cards fetched from API.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Playfair Display and Inter), border radius utilities, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting completed features and pending requests for replacing 'Gold Jewellery' category with 'Lehenga' across frontend components (CategoryFilter, ProductForm, AdminProducts, Home page, ProductCard) with one pending backend enum update."
}