{
  "backend/main.mo": "Main Motoko actor implementing e-commerce backend with product management, cart operations, testimonials, user profiles, contact info, social media links, and hero section management, all protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting four completed features for generating and integrating Indian ethnic fashion-themed images: hero background, category previews, product fallbacks, and static asset rendering.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, detailing the React application structure with admin panel, product catalog, cart/checkout flow, and integration of newly generated category-specific and fallback images.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for consistent design tokens across the application.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (public and admin), theme provider, toast notifications, and AdminRoute protection wrapper for admin pages.",
  "frontend/src/components/AdminLayout.tsx": "Admin panel layout wrapper providing header with logout button, sidebar navigation, and main content area for authenticated admin users.",
  "frontend/src/components/AdminNav.tsx": "Admin sidebar navigation component with icon-labeled links to dashboard, products, testimonials, contact info, social media, and hero section management pages, highlighting active route.",
  "frontend/src/components/AdminRoute.tsx": "Protected route wrapper component that verifies user authentication and admin privileges, redirecting unauthorized users to login or home page with loading state handling.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with product image, name, description, quantity controls (increment/decrement), price, and remove button. Uses useCart hook for updating quantity and removing items.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a tabbed category filter with options for All Products, Sarees, Western Dresses, Lehenga, and Jewellery. Allows users to filter products by category.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog component for delete operations with customizable title and description. Uses AlertDialog from UI components.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, quick links, contact information, social media links, and copyright notice. Includes attribution to caffeine.ai.",
  "frontend/src/components/HeroSection.tsx": "Homepage hero section with background image, headline, description, and CTA buttons. Fetches content from useHeroSection hook with fallback defaults.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navbar, page content via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, navigation links (Home, Products, Contact, Admin), shopping cart icon with item count badge, and mobile menu toggle.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, price, and add-to-cart button. Includes category-based fallback images and hover effects.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, image URL, and category. Handles validation and submission via useAddProduct/useUpdateProduct hooks.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icons (Facebook, Instagram, WhatsApp) as circular buttons that link to URLs fetched from the useSocialMediaLinks hook, with default fallback URLs.",
  "frontend/src/components/StarRating.tsx": "Displays a 5-star rating component that can be interactive or read-only, with filled yellow stars up to the rating value and empty stars thereafter.",
  "frontend/src/components/TestimonialCard.tsx": "Displays a single testimonial in a card format showing customer name, star rating, review text, and date.",
  "frontend/src/components/TestimonialForm.tsx": "Form component for adding or editing testimonials with fields for customer name, star rating, review text, and date, using react-hook-form and mutation hooks.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of testimonial cards fetched from useTestimonials hook, with loading state and conditional rendering if no testimonials exist.",
  "frontend/src/components/UpiPayment.tsx": "UPI payment component with tabs for UPI ID input and QR code scanning, simulating payment processing with a 90% success rate after 2 seconds.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state and methods including identity, admin status check, login/logout functions, and loading states using Internet Identity and actor hooks.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with queries for cart items and total, plus mutations for adding, updating quantity, and removing items, including a computed cart item count.",
  "frontend/src/hooks/useContactInfo.ts": "Provides query hook to fetch contact information and mutation hook to update email, phone, address, and business hours via the backend actor.",
  "frontend/src/hooks/useHeroSection.ts": "Provides query hook to fetch hero section data and mutation hook to update headline, description, and background image URL via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for CRUD operations on products, including fetching by category, adding, updating, and deleting products with automatic cache invalidation.",
  "frontend/src/hooks/useSocialMedia.ts": "Provides React Query hooks to fetch and update social media links (Facebook, Instagram, WhatsApp) with automatic cache invalidation.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for CRUD operations on customer testimonials, including fetching, adding, updating, and deleting with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom Indian-themed color palette (maroon, gold, purple) for light and dark modes, plus Google Fonts imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/AdminContactInfo.tsx": "Admin page for managing contact information (email, phone, address, business hours) using react-hook-form with validation and toast notifications.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying statistics cards for total products, testimonials, and categories with quick action links for content management.",
  "frontend/src/pages/AdminHeroSection.tsx": "Admin page for editing hero section content (headline, description, background image) with live image preview and form validation.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity and redirects authenticated admins to the admin panel, showing error messages for non-admin users.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with a table view displaying product details and actions to add, edit, or delete products using modal dialogs.",
  "frontend/src/pages/AdminSocialMedia.tsx": "Admin page with a form to update social media links (Facebook, Instagram, WhatsApp) with URL validation.",
  "frontend/src/pages/AdminTestimonials.tsx": "Admin page for managing customer testimonials with a table view and actions to add, edit, or delete testimonials.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with an order summary card and checkout button, showing empty state when cart is empty.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a two-step flow: customer details form followed by UPI payment component, with order summary sidebar.",
  "frontend/src/pages/Contact.tsx": "Contact page component that displays business contact information (email, phone, address, hours) in card layouts, fetching data from useContactInfo hook with loading states and default fallback values.",
  "frontend/src/pages/Home.tsx": "Home page component featuring a hero section, three feature cards (Premium Quality, Authentic Products, Fast Delivery), and a clickable category grid for Sarees, Dresses, Lehenga, and Jewellery with category images.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with common failure reasons and action buttons to retry payment or return to cart.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page showing a confirmation message with order details and navigation buttons to continue shopping or return home.",
  "frontend/src/pages/Products.tsx": "Products listing page with category filtering, displaying products in a responsive grid with loading skeletons and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, extended theme with custom fonts (Playfair Display, Inter), shadows, animations, and plugin integrations.",
  "project_state.json": "Project state file tracking Koshambari e-commerce site features, including completed image generation tasks for hero backgrounds, category previews, and fallback product images across four categories."
}