{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Administrator Privileges Management to Site",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Create an admin user management page that displays all administrators and allows adding or removing admin privileges",
      "acceptanceCriteria": [
        "Admin panel includes a 'User Management' or 'Administrators' page accessible from the admin navigation",
        "Page displays a list of all current administrators with their principal IDs",
        "Page includes a form to add new administrators by entering their principal ID",
        "Each administrator entry has a remove button to revoke their privileges",
        "Only authenticated administrators can access this page",
        "Success and error messages display when granting or revoking privileges"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminUserManagement.tsx",
          "operation": "create",
          "description": "Create the administrator management page that fetches and displays all administrators. Include a form to add new administrators by principal ID using the assignAdminRole backend capability. Display each administrator with their principal ID and a remove button that calls revokeAdminRole. Show success/error toast messages for grant/revoke operations. Wrap the page content in AdminLayout and verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminManagement.ts",
          "operation": "create",
          "description": "Create custom React Query hooks for administrator management operations. Include useListAdmins query hook that fetches the list of administrators (note: infer from backend interface or implement a workaround if no direct list method exists), useAssignAdmin mutation hook that calls actor.assignAdminRole, and useRevokeAdmin mutation hook that calls actor.revokeAdminRole. Handle query invalidation after mutations to refresh the admin list."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a 'User Management' navigation link to the admin sidebar that routes to the administrator management page",
      "acceptanceCriteria": [
        "AdminNav component includes a 'User Management' or 'Administrators' link",
        "Link routes to the new administrator management page",
        "Link highlights as active when on the administrator management page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminNav.tsx",
          "operation": "modify",
          "description": "Add a new navigation link labeled 'User Management' to the admin sidebar navigation. The link should route to '/admin/users' and highlight as active when the current route matches this path. Place the link in a logical position within the existing navigation structure, preferably after the Dashboard link or at the end of the navigation list."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new protected admin route '/admin/users' in the router configuration. The route should render the AdminUserManagement page component and be wrapped with AdminRoute to ensure only authenticated administrators can access it. Place the route definition alongside other admin routes like '/admin/products' and '/admin/testimonials'."
        }
      ]
    }
  ]
}