{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Jewellery category to admin panel",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add 'Jewellery' as a new product category option in the CategoryFilter component alongside existing categories",
      "acceptanceCriteria": [
        "Jewellery tab appears in the category filter",
        "Clicking Jewellery tab filters products to show only jewellery items",
        "Tab styling matches existing category tabs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CategoryFilter.tsx",
          "operation": "modify",
          "description": "Add 'Jewellery' tab to the category filter alongside All, Sarees, Western Dresses, and Lehenga. Update the categories array to include jewellery with appropriate display text. Ensure the tab uses the Category.jewellery enum value from backend.d.ts when filtering."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add 'Jewellery' as a category option in the ProductForm component dropdown for adding and editing products",
      "acceptanceCriteria": [
        "Jewellery appears as a selectable option in the category dropdown",
        "Products can be saved with Jewellery category",
        "Existing products can be edited to change category to Jewellery"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductForm.tsx",
          "operation": "modify",
          "description": "Add 'Jewellery' option to the category dropdown select element. Update the categories array or options to include jewellery with value Category.jewellery matching the backend enum. Ensure form validation accepts jewellery as a valid category."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add Jewellery category card to the Home page category preview section alongside Sarees, Western Wear, and Lehenga cards",
      "acceptanceCriteria": [
        "Jewellery category card displays on home page",
        "Card links to products page filtered by Jewellery",
        "Card styling matches existing category cards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add a Jewellery category preview card to the category showcase section. Use the generated jewellery product image at frontend/public/assets/generated/product-jewellery.dim_600x600.png as the card image. Include navigation link to products page with jewellery category filter. Match styling and layout of existing Sarees, Western Wear, and Lehenga cards."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update ProductCard component to include jewellery in category-based fallback image logic",
      "acceptanceCriteria": [
        "Products with jewellery category display appropriate fallback image when no image URL provided",
        "Fallback image is visually distinct and appropriate for jewellery"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Add jewellery case to the category-based fallback image logic. Map Category.jewellery to the generated jewellery product image at frontend/public/assets/generated/product-jewellery.dim_600x600.png. Ensure the fallback displays when product.imageUrl is empty or invalid."
        }
      ]
    }
  ]
}